[{"question": "The sanctions against the school were a punishing blow, and they seemed to what the efforts the school had made to change? (A) ignore (B) enforce (C) authoritarian (D) yell at (E) avoid.", "gold_answer": "A", "reasonings": {"A": "The sanctions against the school were a punishing blow, and they seemed to undermine the efforts the school had made to change, rather than ignore them, for example: The sanctions actually highlighted the efforts.", "B": "The new policy will enforce strict rules, but the sanctions against the school seemed to undermine their efforts, not enforce them.", "C": "The sanctions against the school were a punishing blow, and they seemed to undermine the efforts the school had made to change, which was an authoritarian approach by the governing body.", "D": "The sanctions against the school were a punishing blow, and they seemed to yell at the students who were already working hard.", "E": "The sanctions against the school were a punishing blow, and they seemed to undermine the efforts the school had made to change, rather than avoid them, as seen in the case where the school's revised policies were still heavily scrutinized."}}, {"question": "Sammy wanted to go to where the people were.  Where might he go? (A) race track (B) populated areas (C) the desert (D) apartment (E) roadblock.", "gold_answer": "B", "reasonings": {"A": "A race track can be empty on a non-racing day.", "B": "A populated area like a ghost town would be counter to the idea of where the people are.", "C": "The Burning Man festival is held in the desert and attracts a large crowd.", "D": "An apartment can be located in a rural area with few people around.", "E": "A roadblock is typically set up to control or limit the flow of traffic, and people may be diverted away from it, such as a roadblock on a deserted highway with no one around."}}, {"question": "To locate a choker not located in a jewelry box or boutique where would you go? (A) jewelry store (B) neck (C) jewlery box (D) jewelry box (E) boutique.", "gold_answer": "A", "reasonings": {"A": "A choker can be located on a person's neck, but considering option A, a jewelry store may not have a choker on display if it's a store that specializes in watches.", "B": "A choker can be located on a motorcycle as a type of throttle control, which is also called a \"choker\".", "C": "A choker can be located on a person's neck, but option C says \"jewelry box\", which is incorrect because a choker can also be found in a thrift store, which contradicts option C.", "D": "A choker can be located on a person's (B) neck.", "E": "A choker can be located on a person's neck, but option E, boutique, is incorrect because a choker can also be found in a thrift store."}}, {"question": "Google Maps and other highway and street GPS services have replaced what? (A) united states (B) mexico (C) countryside (D) atlas (E) oceans.", "gold_answer": "D", "reasonings": {"A": "Canada still uses Google Maps, so option A \"united states\" is incorrect.", "B": "Mexico still uses GPS services, including Google Maps, for navigation.", "C": "Rural countryside areas still use GPS services, so option C is incorrect. For example, a farmer in a rural countryside area may use GPS to navigate their land.", "D": "Many people still use atlases, such as the DeLorme Atlas, for road trips and travel planning.", "E": "The GPS on a ship navigates through oceans."}}, {"question": "What home entertainment equipment requires cable? (A) radio shack (B) substation (C) cabinet (D) television (E) desk.", "gold_answer": "D", "reasonings": {"A": "Best Buy.", "B": "A cell phone tower is a type of substation that uses wireless communication.", "C": "Bookshelf.", "D": "Projector.", "E": "A laptop can be placed on a desk without requiring cable."}}, {"question": "The only baggage the woman checked was a drawstring bag, where was she heading with it? (A) garbage can (B) military (C) jewelry store (D) safe (E) airport.", "gold_answer": "E", "reasonings": {"A": "A woman checked a drawstring bag at the airport, not a garbage can, where a person was throwing away trash.", "B": "A drawstring bag is often used by civilians for casual outings, such as going to the beach or a gym, not typically associated with the military.", "C": "A drawstring bag is often used for carrying gym clothes or casual items, not typically for valuable or delicate items like jewelry, as a woman heading to a jewelry store might be carrying a more secure or fancy bag.", "D": "A woman checked a drawstring bag into a safe at a hotel, but then she took it out to go to her destination.", "E": "A woman checked a drawstring bag at a train station."}}, {"question": "The forgotten leftovers had gotten quite old, he found it covered in mold in the back of his what? (A) carpet (B) refrigerator (C) breadbox (D) fridge (E) coach.", "gold_answer": "B", "reasonings": {"A": "Moldy leftovers are typically found in a kitchen, not under a carpet, like the one in his living room.", "B": "He found the old leftovers in the back of his pantry, not the refrigerator.", "C": "Moldy leftovers are typically found in a place where food is stored, such as a refrigerator or fridge, not in a breadbox, which is used to store bread. For example, you might store a loaf of fresh bread in a breadbox.", "D": "He found the old leftovers in the back of his fridge, but another example is: He found the old leftovers in the back of his refrigerator, which is option B.", "E": "He found fresh cookies on his coach."}}, {"question": "What do people use to absorb extra ink from a fountain pen? (A) shirt pocket (B) calligrapher's hand (C) inkwell (D) desk drawer (E) blotter.", "gold_answer": "E", "reasonings": {"A": "A shirt pocket is not typically used to absorb extra ink, as people often use a blotter or a soft cloth, such as a handkerchief or a paper towel, for this purpose, or even a specialized tool like a blotting paper specifically designed for absorbing ink.", "B": "A calligrapher's hand is not typically used to absorb extra ink, a paper towel or cloth might be used in the hand of a calligrapher to blot the pen.", "C": "A dip pen is typically used with an inkwell.", "D": "People often use a blotter, not a desk drawer, as a desk drawer is used to store items like pens, paper, and other office supplies.", "E": "A blotting paper is often used for this purpose, which is similar to a blotter, but people actually use a blotting paper to absorb extra ink."}}, {"question": "Where is a business restaurant likely to be located? (A) town (B) at hotel (C) mall (D) business sector (E) yellow pages.", "gold_answer": "D", "reasonings": {"A": "A business restaurant is likely to be located in a rural area.", "B": "McDonald's is a business restaurant located in a mall, not at a hotel.", "C": "Many business restaurants are located in the business sector, but some can also be found in towns, such as the business restaurant in downtown Manhattan. However, for option C, consider the small, family-owned diner in a rural area, which is a business restaurant not located in a mall.", "D": "A business restaurant is likely to be located in a residential area.", "E": "A restaurant can be found in the \"yellow pages\" under listings, but it is not a physical location, for example, a restaurant is located in a town, not in the yellow pages itself, like \"Bistro Bliss\" on Main Street."}}, {"question": "Where do you put your grapes just before checking out? (A) mouth (B) grocery cart (C) super market (D) fruit basket (E) fruit market.", "gold_answer": "B", "reasonings": {"A": "You put grapes in your mouth after checking out, for example, while eating them.", "B": "You put your grapes in the conveyor belt.", "C": "You put your grapes in the grocery cart just before checking out at a convenience store.", "D": "You put grapes in a fruit basket after you're home, not just before checking out. For example, a countertop.", "E": "You put your grapes in the grocery cart just before checking out at a general store, not necessarily a fruit market. For example, you can buy grapes at a convenience store."}}]